var express = require('express');
var router = express.Router();

/* GET home page. */
router.get('/', function(req, res, next) {
  res.render('index', { title: 'Express' });
});
router.get("/Alukard",function(req,res,next){
    res.render('hero',{
        title:"Alukard",
        picture: "images/fd.jpg",
        about: "Во вселенной Хеллсинга Алукард (Дракула) не был убит, вместо этого при помощи алхимии он был порабощён для службы потомкам Ван Хельсинга. В какой-то момент Алукард был заперт в подземелье поместья Хеллсинг и позже освобождён дочерью Артура, Интегрой. С того момента Интегра становится хозяйкой Алукарда."
    })
})
router.get("/Seyras",function(req,res,next){
    res.render('hero',{
        title:"Виктория Сейрас",
        picture: "images/02951296.gif",
        about: 'Бывший офицер полиции Лондона, ставшая членом организации «Хеллсинг». Родителей Серас убили у неё на глазах, когда она была ещё ребёнком. Её отец также был офицером полиции, поэтому Виктория твёрдо решила пойти по его стопам, несмотря на возражения окружающих. В период службы в полиции получила прозвище «котёнок». В ходе инцидента в деревне Чедарс была смертельно ранена и обращена в вампира Алукардом с её собственного согласия. Называет Алукарда «хозяином», а тот, в свою очередь, редко обращается к ней по имени, обычно называя её полицейской \n' +
        '\n' +
        'Поначалу Виктория является слабейшим из вампиров. Не обладает особыми способностями, за исключением зрения вампиров, физической силы и регенерации. Долгое время отказывалась пить кровь и сопротивлялась своей вампирской сущности, что негативно сказывалось на её боевых способностях. В конечном итоге принимает свою сущность по просьбе лидера группы наёмников «Дикие гуси».'
    })
})
router.get("/Dolnez",function(req,res,next){
    res.render('hero',{
        title:"Уолтер К. Долне́",
        picture: "images/Walter_C_Dornez_1.jpg",
        about: "Водитель, телохранитель и ближайший помощник Интегры Хеллсинг. За выдающие навыки охоты на вампиров получил прозвище «Ангел смерти». В качестве оружия использует тонкие нити, похожие на струны. С их помощью может разрезать одного или нескольких противников на множество частей, в большинстве случаев противник не успевает понять, что произошло. Может использовать свои нити в качестве щита или парашюта, сплетая их в полотно. Занимается разработкой различных видов оружия для организации, в частности, он создал для Алукарда пистолет «Шакал» и пушку «Харконнен» для Виктории. 55 лет назад, будучи подростком, вместе с Алукардом принимал участие в операции по уничтожению последних очагов нацистского сопротивления, где впервые встретился с Майором и его подчинёнными."
    })
})
router.get("/Integra",function(req,res,next){
    res.render('hero',{
        title:"Инте́гра Фэ́йрбрук Уи́нгейтс Хе́ллсинг",
        picture: "images/Интегра_Хеллсинг1.jpg",
        about: "Действующая глава организации Хеллсинг. Унаследовала свою позицию в возрасте 12 лет, после смерти отца — Артура Хеллсинга. Его брат Ричард пытался убить Интегру, чтобы стать во главе семьи. Убегая от Ричарда и его людей, Интегра оказалась в одной из камер заброшенного подземелья особняка, где был заточён Алукард. Кровь из раны Интегры пробудила его. Он убил приспешников Ричарда и присягнул на верность Интегре."
    })
})

module.exports = router;
